#include <stdio.h>
#include "tree.h"

int PN[MAX + 1];	/* 부모 노드 정보 저장 배열 */
int CL[MAX + 1];	/* 좌측 자식 정보 저장 배열 */
int CR[MAX + 1];	/* 우측 자식 정보 저장 배열 */
int cnt;

/*----------------------------------------------------------------------
Function Name 	: createTree() - 이진트리 구성함수
인수 			: 없음
반환값 			: 없음
----------------------------------------------------------------------*/
void createTree(void)
{
	int vertex;
	int edge;
	int i;

	// TODO
}

/*--------------------------------------------------------------
Function Name 	: TR() - 이진트리 순회 함수
인수 			: n - 순회 노드 번호
반환값 			: 없음
--------------------------------------------------------------*/
void TR(int n)
{
	// TODO
}

/*-------------------------------------------------------------
Function Name 	: FND() - 조상노드 검색 함수
인수 			: n - 조상노드를 검색할 대상노드
반환값 			: 없음 
-------------------------------------------------------------*/
void FND(int n)
{
	// TODO
}
